shivanshBTW/esp32-pc-controller/sdkconfig.defaults
# Board: ESP32-S3-WROOM-1-N16R8 (16MB flash, 8MB Octal PSRAM)
CONFIG_IDF_TARGET="esp32s3"

CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_UART_DEFAULT=n

CONFIG_FREERTOS_HZ=1000

CONFIG_ESP_WIFI_SOFTAP_SUPPORT=y

CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512

CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# OTA dual-slot partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000

# mDNS
CONFIG_MDNS_MAX_SERVICES=10

# Matter (ESP-Matter / CHIP) — keep SoftAP; do not copy example's CONFIG_ESP_WIFI_SOFTAP_SUPPORT=n
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ENABLE_CONN_REATTEMPT=n
CONFIG_LWIP_IPV6_AUTOCONFIG=y
CONFIG_LWIP_HOOK_IP6_ROUTE_DEFAULT=y
CONFIG_LWIP_HOOK_ND6_GET_GW_DEFAULT=y
CONFIG_LWIP_IPV6_NUM_ADDRESSES=6
CONFIG_MBEDTLS_HKDF_C=y
# Share ESP-IDF mDNS with waketype.local — CHIP's extra mDNS stack breaks HA discovery.
# CONFIG_USE_MINIMAL_MDNS is not set
CONFIG_ENABLE_WIFI_STATION=y
CONFIG_ENABLE_WIFI_AP=n
CONFIG_ENABLE_CHIP_SHELL=n
CONFIG_ENABLE_OTA_REQUESTOR=n
CONFIG_ESP_MATTER_MAX_DYNAMIC_ENDPOINT_COUNT=2
CONFIG_DEVICE_VENDOR_ID=0xFFF1
CONFIG_DEVICE_PRODUCT_ID=0x8005
CONFIG_CHIP_DEVICE_VENDOR_NAME="WakeType"
CONFIG_CHIP_DEVICE_PRODUCT_NAME="WakeType PC"
# Use the existing NVS partition so Matter can start before a USB partition-table flash.
CONFIG_CHIP_FACTORY_NAMESPACE_PARTITION_LABEL="nvs"
CONFIG_CHIP_CONFIG_NAMESPACE_PARTITION_LABEL="nvs"
CONFIG_CHIP_COUNTERS_NAMESPACE_PARTITION_LABEL="nvs"
CONFIG_CHIP_KVS_NAMESPACE_PARTITION_LABEL="nvs"
CONFIG_ENABLE_ESP32_FACTORY_DATA_PROVIDER=n
CONFIG_EXAMPLE_DAC_PROVIDER=y
